# В некоторых изданиях, например, NY Times (www.nytimes.com) заголовки статей печатают так, чтобы каждое слово было с большой буквы. На вход вашей программе подается строка со словами, разделенными пробелом. Напишите ее как заголовок в NY Times. Может использоваться как кириллица, так и латиница.
# Формат ввода: Python изучают все больше людей
# Формат вывода: Python Изучают Все Больше Людей
s = 'Python изучают все больше людей'
print(s.title())
